micropython/micropython/stmhal/hal/l4/inc/stm32l4xx_hal_comp.h
/* Peripheral State functions  **************************************************/
/** @addtogroup COMP_Exported_Functions_Group4
  * @{
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup COMP_Private_Constants COMP Private Constants
  * @{
  */
/** @defgroup COMP_ExtiLine COMP EXTI Lines
  * @{
  */
#define COMP_EXTI_LINE_COMP1           ((uint32_t)0x00200000)  /*!< EXTI line 21 connected to COMP1 output */
#define COMP_EXTI_LINE_COMP2           ((uint32_t)0x00400000)  /*!< EXTI line 22 connected to COMP2 output */
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup COMP_Private_Macros COMP Private Macros
  * @{
  */
/** @defgroup COMP_GET_EXTI_LINE COMP Private macros to get EXTI line associated with Comparators 
  * @{
  */
/**
  * @brief  Get the specified EXTI line for a comparator instance.
  * @param  __INSTANCE__  specifies the COMP instance.
  * @retval value of @ref COMP_ExtiLine
  */
#define COMP_GET_EXTI_LINE(__INSTANCE__)             (((__INSTANCE__) == COMP1) ? COMP_EXTI_LINE_COMP1 : \
                                                      COMP_EXTI_LINE_COMP2)
/**
  * @}
  */

/** @defgroup COMP_IS_COMP_Definitions COMP Private macros to check input parameters
  * @{
  */

#define IS_COMP_INVERTINGINPUT(__INPUT__) (((__INPUT__) == COMP_INVERTINGINPUT_1_4VREFINT)  || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_1_2VREFINT)  || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_3_4VREFINT)  || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_VREFINT)     || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_DAC1)        || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_DAC2)        || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_IO1)         || \
                                           ((__INPUT__) == COMP_INVERTINGINPUT_IO2))

#define IS_COMP_NONINVERTINGINPUT(__INPUT__) (((__INPUT__) == COMP_NONINVERTINGINPUT_IO1) || \
                                              ((__INPUT__) == COMP_NONINVERTINGINPUT_IO2))

#define IS_COMP_OUTPUTPOL(__POL__)  (((__POL__) == COMP_OUTPUTPOL_NONINVERTED)  || \
                                     ((__POL__) == COMP_OUTPUTPOL_INVERTED))

#define IS_COMP_MODE(__MODE__)  (((__MODE__) == COMP_MODE_HIGHSPEED)     || \
                                 ((__MODE__) == COMP_MODE_MEDIUMSPEED)   || \
                                 ((__MODE__) == COMP_MODE_ULTRALOWPOWER))

#define IS_COMP_HYSTERESIS(__HYSTERESIS__) (((__HYSTERESIS__) == COMP_HYSTERESIS_NONE)   || \
                                            ((__HYSTERESIS__) == COMP_HYSTERESIS_LOW)    || \
                                            ((__HYSTERESIS__) == COMP_HYSTERESIS_MEDIUM) || \
                                            ((__HYSTERESIS__) == COMP_HYSTERESIS_HIGH))

#define IS_COMP_BLANKINGSRCE(__SOURCE__) (((__SOURCE__) == COMP_BLANKINGSRCE_NONE)     || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM1OC5)  || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM2OC3)  || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM3OC3)  || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM3OC4)  || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM8OC5)  || \
                                          ((__SOURCE__) == COMP_BLANKINGSRCE_TIM15OC1))

#define IS_COMP_BLANKINGSRCE_INSTANCE(__INSTANCE__, __BLANKINGSRCE__) \
   ((((__INSTANCE__) == COMP1)  &&                                    \
    (((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_NONE)     ||            \
     ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM1OC5)  ||            \
     ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM2OC3)  ||            \
     ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM3OC3)))              \
    ||                                                                \
    (((__INSTANCE__) == COMP2) &&                                     \
     (((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_NONE)    ||            \
      ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM3OC4) ||            \
      ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM8OC5) ||            \
      ((__BLANKINGSRCE__) == COMP_BLANKINGSRCE_TIM15OC1))))

#define IS_COMP_WINDOWMODE(__WINDOWMODE__) (((__WINDOWMODE__) == COMP_WINDOWMODE_DISABLE) || \
                                            ((__WINDOWMODE__) == COMP_WINDOWMODE_ENABLE))

#define IS_COMP_TRIGGERMODE(__MODE__)  (((__MODE__) == COMP_TRIGGERMODE_NONE)                 || \
                                        ((__MODE__) == COMP_TRIGGERMODE_IT_RISING)            || \
                                        ((__MODE__) == COMP_TRIGGERMODE_IT_FALLING)           || \
                                        ((__MODE__) == COMP_TRIGGERMODE_IT_RISING_FALLING)    || \
                                        ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING)         || \
                                        ((__MODE__) == COMP_TRIGGERMODE_EVENT_FALLING)        || \
                                        ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING_FALLING))

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32L4xx_HAL_COMP_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
